Основные стандартные модули Python.

sys - обработка элементов коммандной строки, возврат кода завершения программы и т.д..
platform - позволяет получить платформо зависимые данные, данные ОС, используется для получения версии ОС.
os - позволяет изнутри программы на Питон выполнить операции, которые мы обычно выполняем из коммандной строки,
например создание папки, удаление папки, создание файла, удаление файла.
os.path - манипуляции с путями к файлам, преобразовать абсолютный путь в относительный или наоборот,
проверить существует ли файл или не существует, файл это или папка
zlib, gzip, zipfile - модули работающие с архивами.
math - работа с математикой
cmath - математика с комплексной переменной.
codecs - кодировки, кодировка строк
random - псевдослучайные числа, на Windows работает плохо.
hashlib - CRC различные алгоритмы.
re - регулярные выражения.
decimal - работа с фиксированной точкой, используется в бугалтерии.
csv - обработка файла в формате CSV, т.е. файл значения которого разделены запятыми.
Модули обработки формата XML
XML.DOM - методом DOM, более востребован.
XML.SAX = методом SAX.